{"payload":{"allShortcutsEnabled":false,"fileTree":{"samples/dnn/face_detector":{"items":[{"name":".gitignore","path":"samples/dnn/face_detector/.gitignore","contentType":"file"},{"name":"deploy.prototxt","path":"samples/dnn/face_detector/deploy.prototxt","contentType":"file"},{"name":"deploy_lowres.prototxt","path":"samples/dnn/face_detector/deploy_lowres.prototxt","contentType":"file"},{"name":"how_to_train_face_detector.txt","path":"samples/dnn/face_detector/how_to_train_face_detector.txt","contentType":"file"},{"name":"opencv_face_detector.pbtxt","path":"samples/dnn/face_detector/opencv_face_detector.pbtxt","contentType":"file"},{"name":"solver.prototxt","path":"samples/dnn/face_detector/solver.prototxt","contentType":"file"},{"name":"test.prototxt","path":"samples/dnn/face_detector/test.prototxt","contentType":"file"},{"name":"train.prototxt","path":"samples/dnn/face_detector/train.prototxt","contentType":"file"},{"name":"weights.meta4","path":"samples/dnn/face_detector/weights.meta4","contentType":"file"}],"totalCount":9},"samples/dnn":{"items":[{"name":"dnn_model_runner","path":"samples/dnn/dnn_model_runner","contentType":"directory"},{"name":"face_detector","path":"samples/dnn/face_detector","contentType":"directory"},{"name":"results","path":"samples/dnn/results","contentType":"directory"},{"name":".gitignore","path":"samples/dnn/.gitignore","contentType":"file"},{"name":"CMakeLists.txt","path":"samples/dnn/CMakeLists.txt","contentType":"file"},{"name":"README.md","path":"samples/dnn/README.md","contentType":"file"},{"name":"action_recognition.py","path":"samples/dnn/action_recognition.py","contentType":"file"},{"name":"classification.cpp","path":"samples/dnn/classification.cpp","contentType":"file"},{"name":"classification.py","path":"samples/dnn/classification.py","contentType":"file"},{"name":"colorization.cpp","path":"samples/dnn/colorization.cpp","contentType":"file"},{"name":"colorization.py","path":"samples/dnn/colorization.py","contentType":"file"},{"name":"common.hpp","path":"samples/dnn/common.hpp","contentType":"file"},{"name":"common.py","path":"samples/dnn/common.py","contentType":"file"},{"name":"custom_layers.hpp","path":"samples/dnn/custom_layers.hpp","contentType":"file"},{"name":"dasiamrpn_tracker.cpp","path":"samples/dnn/dasiamrpn_tracker.cpp","contentType":"file"},{"name":"download_models.py","path":"samples/dnn/download_models.py","contentType":"file"},{"name":"edge_detection.py","path":"samples/dnn/edge_detection.py","contentType":"file"},{"name":"face_detect.cpp","path":"samples/dnn/face_detect.cpp","contentType":"file"},{"name":"face_detect.py","path":"samples/dnn/face_detect.py","contentType":"file"},{"name":"fast_neural_style.py","path":"samples/dnn/fast_neural_style.py","contentType":"file"},{"name":"human_parsing.cpp","path":"samples/dnn/human_parsing.cpp","contentType":"file"},{"name":"human_parsing.py","path":"samples/dnn/human_parsing.py","contentType":"file"},{"name":"js_face_recognition.html","path":"samples/dnn/js_face_recognition.html","contentType":"file"},{"name":"mask_rcnn.py","path":"samples/dnn/mask_rcnn.py","contentType":"file"},{"name":"mobilenet_ssd_accuracy.py","path":"samples/dnn/mobilenet_ssd_accuracy.py","contentType":"file"},{"name":"models.yml","path":"samples/dnn/models.yml","contentType":"file"},{"name":"nanotrack_tracker.cpp","path":"samples/dnn/nanotrack_tracker.cpp","contentType":"file"},{"name":"object_detection.cpp","path":"samples/dnn/object_detection.cpp","contentType":"file"},{"name":"object_detection.py","path":"samples/dnn/object_detection.py","contentType":"file"},{"name":"openpose.cpp","path":"samples/dnn/openpose.cpp","contentType":"file"},{"name":"openpose.py","path":"samples/dnn/openpose.py","contentType":"file"},{"name":"optical_flow.py","path":"samples/dnn/optical_flow.py","contentType":"file"},{"name":"person_reid.cpp","path":"samples/dnn/person_reid.cpp","contentType":"file"},{"name":"person_reid.py","path":"samples/dnn/person_reid.py","contentType":"file"},{"name":"scene_text_detection.cpp","path":"samples/dnn/scene_text_detection.cpp","contentType":"file"},{"name":"scene_text_recognition.cpp","path":"samples/dnn/scene_text_recognition.cpp","contentType":"file"},{"name":"scene_text_spotting.cpp","path":"samples/dnn/scene_text_spotting.cpp","contentType":"file"},{"name":"segmentation.cpp","path":"samples/dnn/segmentation.cpp","contentType":"file"},{"name":"segmentation.py","path":"samples/dnn/segmentation.py","contentType":"file"},{"name":"shrink_tf_graph_weights.py","path":"samples/dnn/shrink_tf_graph_weights.py","contentType":"file"},{"name":"siamrpnpp.py","path":"samples/dnn/siamrpnpp.py","contentType":"file"},{"name":"speech_recognition.cpp","path":"samples/dnn/speech_recognition.cpp","contentType":"file"},{"name":"speech_recognition.py","path":"samples/dnn/speech_recognition.py","contentType":"file"},{"name":"text_detection.cpp","path":"samples/dnn/text_detection.cpp","contentType":"file"},{"name":"text_detection.py","path":"samples/dnn/text_detection.py","contentType":"file"},{"name":"tf_text_graph_common.py","path":"samples/dnn/tf_text_graph_common.py","contentType":"file"},{"name":"tf_text_graph_efficientdet.py","path":"samples/dnn/tf_text_graph_efficientdet.py","contentType":"file"},{"name":"tf_text_graph_faster_rcnn.py","path":"samples/dnn/tf_text_graph_faster_rcnn.py","contentType":"file"},{"name":"tf_text_graph_mask_rcnn.py","path":"samples/dnn/tf_text_graph_mask_rcnn.py","contentType":"file"},{"name":"tf_text_graph_ssd.py","path":"samples/dnn/tf_text_graph_ssd.py","contentType":"file"},{"name":"virtual_try_on.py","path":"samples/dnn/virtual_try_on.py","contentType":"file"}],"totalCount":51},"samples":{"items":[{"name":"android","path":"samples/android","contentType":"directory"},{"name":"cpp","path":"samples/cpp","contentType":"directory"},{"name":"data","path":"samples/data","contentType":"directory"},{"name":"directx","path":"samples/directx","contentType":"directory"},{"name":"dnn","path":"samples/dnn","contentType":"directory"},{"name":"gdb","path":"samples/gdb","contentType":"directory"},{"name":"gpu","path":"samples/gpu","contentType":"directory"},{"name":"hal","path":"samples/hal","contentType":"directory"},{"name":"install","path":"samples/install","contentType":"directory"},{"name":"java","path":"samples/java","contentType":"directory"},{"name":"opencl","path":"samples/opencl","contentType":"directory"},{"name":"opengl","path":"samples/opengl","contentType":"directory"},{"name":"openvx","path":"samples/openvx","contentType":"directory"},{"name":"python","path":"samples/python","contentType":"directory"},{"name":"semihosting","path":"samples/semihosting","contentType":"directory"},{"name":"swift","path":"samples/swift","contentType":"directory"},{"name":"sycl","path":"samples/sycl","contentType":"directory"},{"name":"tapi","path":"samples/tapi","contentType":"directory"},{"name":"va_intel","path":"samples/va_intel","contentType":"directory"},{"name":"winrt","path":"samples/winrt","contentType":"directory"},{"name":"winrt_universal","path":"samples/winrt_universal","contentType":"directory"},{"name":"wp8","path":"samples/wp8","contentType":"directory"},{"name":"CMakeLists.example.in","path":"samples/CMakeLists.example.in","contentType":"file"},{"name":"CMakeLists.txt","path":"samples/CMakeLists.txt","contentType":"file"},{"name":"_winpack_build_sample.cmd","path":"samples/_winpack_build_sample.cmd","contentType":"file"},{"name":"_winpack_run_python_sample.cmd","path":"samples/_winpack_run_python_sample.cmd","contentType":"file"},{"name":"samples_utils.cmake","path":"samples/samples_utils.cmake","contentType":"file"}],"totalCount":27},"":{"items":[{"name":".github","path":".github","contentType":"directory"},{"name":"3rdparty","path":"3rdparty","contentType":"directory"},{"name":"apps","path":"apps","contentType":"directory"},{"name":"cmake","path":"cmake","contentType":"directory"},{"name":"data","path":"data","contentType":"directory"},{"name":"doc","path":"doc","contentType":"directory"},{"name":"include","path":"include","contentType":"directory"},{"name":"modules","path":"modules","contentType":"directory"},{"name":"platforms","path":"platforms","contentType":"directory"},{"name":"samples","path":"samples","contentType":"directory"},{"name":".editorconfig","path":".editorconfig","contentType":"file"},{"name":".gitattributes","path":".gitattributes","contentType":"file"},{"name":".gitignore","path":".gitignore","contentType":"file"},{"name":"CMakeLists.txt","path":"CMakeLists.txt","contentType":"file"},{"name":"CONTRIBUTING.md","path":"CONTRIBUTING.md","contentType":"file"},{"name":"COPYRIGHT","path":"COPYRIGHT","contentType":"file"},{"name":"LICENSE","path":"LICENSE","contentType":"file"},{"name":"README.md","path":"README.md","contentType":"file"},{"name":"SECURITY.md","path":"SECURITY.md","contentType":"file"}],"totalCount":19}},"fileTreeProcessingTime":17.070757999999998,"foldersToFetch":[],"reducedMotionEnabled":null,"repo":{"id":5108051,"defaultBranch":"4.x","name":"opencv","ownerLogin":"opencv","currentUserCanPush":false,"isFork":false,"isEmpty":false,"createdAt":"2012-07-19T09:40:17.000Z","ownerAvatar":"https://avatars.githubusercontent.com/u/5009934?v=4","public":true,"private":false,"isOrgOwned":true},"symbolsExpanded":false,"treeExpanded":true,"refInfo":{"name":"master","listCacheKey":"v0:1700133346.0","canEdit":false,"refType":"branch","currentOid":"0052d46b8e33c7bfe0e1450e4bff28b88f455570"},"path":"samples/dnn/face_detector/deploy.prototxt","currentUser":null,"blob":{"rawLines":["input: \"data\"","input_shape {","  dim: 1","  dim: 3","  dim: 300","  dim: 300","}","","layer {","  name: \"data_bn\"","  type: \"BatchNorm\"","  bottom: \"data\"","  top: \"data_bn\"","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","}","layer {","  name: \"data_scale\"","  type: \"Scale\"","  bottom: \"data_bn\"","  top: \"data_bn\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  param {","    lr_mult: 2.0","    decay_mult: 1.0","  }","  scale_param {","    bias_term: true","  }","}","layer {","  name: \"conv1_h\"","  type: \"Convolution\"","  bottom: \"data_bn\"","  top: \"conv1_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  param {","    lr_mult: 2.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 32","    pad: 3","    kernel_size: 7","    stride: 2","    weight_filler {","      type: \"msra\"","      variance_norm: FAN_OUT","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"conv1_bn_h\"","  type: \"BatchNorm\"","  bottom: \"conv1_h\"","  top: \"conv1_h\"","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","}","layer {","  name: \"conv1_scale_h\"","  type: \"Scale\"","  bottom: \"conv1_h\"","  top: \"conv1_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  param {","    lr_mult: 2.0","    decay_mult: 1.0","  }","  scale_param {","    bias_term: true","  }","}","layer {","  name: \"conv1_relu\"","  type: \"ReLU\"","  bottom: \"conv1_h\"","  top: \"conv1_h\"","}","layer {","  name: \"conv1_pool\"","  type: \"Pooling\"","  bottom: \"conv1_h\"","  top: \"conv1_pool\"","  pooling_param {","    kernel_size: 3","    stride: 2","  }","}","layer {","  name: \"layer_64_1_conv1_h\"","  type: \"Convolution\"","  bottom: \"conv1_pool\"","  top: \"layer_64_1_conv1_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 32","    bias_term: false","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"msra\"","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"layer_64_1_bn2_h\"","  type: \"BatchNorm\"","  bottom: \"layer_64_1_conv1_h\"","  top: \"layer_64_1_conv1_h\"","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","}","layer {","  name: \"layer_64_1_scale2_h\"","  type: \"Scale\"","  bottom: \"layer_64_1_conv1_h\"","  top: \"layer_64_1_conv1_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  param {","    lr_mult: 2.0","    decay_mult: 1.0","  }","  scale_param {","    bias_term: true","  }","}","layer {","  name: \"layer_64_1_relu2\"","  type: \"ReLU\"","  bottom: \"layer_64_1_conv1_h\"","  top: \"layer_64_1_conv1_h\"","}","layer {","  name: \"layer_64_1_conv2_h\"","  type: \"Convolution\"","  bottom: \"layer_64_1_conv1_h\"","  top: \"layer_64_1_conv2_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 32","    bias_term: false","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"msra\"","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"layer_64_1_sum\"","  type: \"Eltwise\"","  bottom: \"layer_64_1_conv2_h\"","  bottom: \"conv1_pool\"","  top: \"layer_64_1_sum\"","}","layer {","  name: \"layer_128_1_bn1_h\"","  type: \"BatchNorm\"","  bottom: \"layer_64_1_sum\"","  top: \"layer_128_1_bn1_h\"","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","}","layer {","  name: \"layer_128_1_scale1_h\"","  type: \"Scale\"","  bottom: \"layer_128_1_bn1_h\"","  top: \"layer_128_1_bn1_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  param {","    lr_mult: 2.0","    decay_mult: 1.0","  }","  scale_param {","    bias_term: true","  }","}","layer {","  name: \"layer_128_1_relu1\"","  type: \"ReLU\"","  bottom: \"layer_128_1_bn1_h\"","  top: \"layer_128_1_bn1_h\"","}","layer {","  name: \"layer_128_1_conv1_h\"","  type: \"Convolution\"","  bottom: \"layer_128_1_bn1_h\"","  top: \"layer_128_1_conv1_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 128","    bias_term: false","    pad: 1","    kernel_size: 3","    stride: 2","    weight_filler {","      type: \"msra\"","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"layer_128_1_bn2\"","  type: \"BatchNorm\"","  bottom: \"layer_128_1_conv1_h\"","  top: \"layer_128_1_conv1_h\"","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","}","layer {","  name: \"layer_128_1_scale2\"","  type: \"Scale\"","  bottom: \"layer_128_1_conv1_h\"","  top: \"layer_128_1_conv1_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  param {","    lr_mult: 2.0","    decay_mult: 1.0","  }","  scale_param {","    bias_term: true","  }","}","layer {","  name: \"layer_128_1_relu2\"","  type: \"ReLU\"","  bottom: \"layer_128_1_conv1_h\"","  top: \"layer_128_1_conv1_h\"","}","layer {","  name: \"layer_128_1_conv2\"","  type: \"Convolution\"","  bottom: \"layer_128_1_conv1_h\"","  top: \"layer_128_1_conv2\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 128","    bias_term: false","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"msra\"","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"layer_128_1_conv_expand_h\"","  type: \"Convolution\"","  bottom: \"layer_128_1_bn1_h\"","  top: \"layer_128_1_conv_expand_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 128","    bias_term: false","    pad: 0","    kernel_size: 1","    stride: 2","    weight_filler {","      type: \"msra\"","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"layer_128_1_sum\"","  type: \"Eltwise\"","  bottom: \"layer_128_1_conv2\"","  bottom: \"layer_128_1_conv_expand_h\"","  top: \"layer_128_1_sum\"","}","layer {","  name: \"layer_256_1_bn1\"","  type: \"BatchNorm\"","  bottom: \"layer_128_1_sum\"","  top: \"layer_256_1_bn1\"","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","}","layer {","  name: \"layer_256_1_scale1\"","  type: \"Scale\"","  bottom: \"layer_256_1_bn1\"","  top: \"layer_256_1_bn1\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  param {","    lr_mult: 2.0","    decay_mult: 1.0","  }","  scale_param {","    bias_term: true","  }","}","layer {","  name: \"layer_256_1_relu1\"","  type: \"ReLU\"","  bottom: \"layer_256_1_bn1\"","  top: \"layer_256_1_bn1\"","}","layer {","  name: \"layer_256_1_conv1\"","  type: \"Convolution\"","  bottom: \"layer_256_1_bn1\"","  top: \"layer_256_1_conv1\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 256","    bias_term: false","    pad: 1","    kernel_size: 3","    stride: 2","    weight_filler {","      type: \"msra\"","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"layer_256_1_bn2\"","  type: \"BatchNorm\"","  bottom: \"layer_256_1_conv1\"","  top: \"layer_256_1_conv1\"","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","}","layer {","  name: \"layer_256_1_scale2\"","  type: \"Scale\"","  bottom: \"layer_256_1_conv1\"","  top: \"layer_256_1_conv1\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  param {","    lr_mult: 2.0","    decay_mult: 1.0","  }","  scale_param {","    bias_term: true","  }","}","layer {","  name: \"layer_256_1_relu2\"","  type: \"ReLU\"","  bottom: \"layer_256_1_conv1\"","  top: \"layer_256_1_conv1\"","}","layer {","  name: \"layer_256_1_conv2\"","  type: \"Convolution\"","  bottom: \"layer_256_1_conv1\"","  top: \"layer_256_1_conv2\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 256","    bias_term: false","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"msra\"","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"layer_256_1_conv_expand\"","  type: \"Convolution\"","  bottom: \"layer_256_1_bn1\"","  top: \"layer_256_1_conv_expand\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 256","    bias_term: false","    pad: 0","    kernel_size: 1","    stride: 2","    weight_filler {","      type: \"msra\"","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"layer_256_1_sum\"","  type: \"Eltwise\"","  bottom: \"layer_256_1_conv2\"","  bottom: \"layer_256_1_conv_expand\"","  top: \"layer_256_1_sum\"","}","layer {","  name: \"layer_512_1_bn1\"","  type: \"BatchNorm\"","  bottom: \"layer_256_1_sum\"","  top: \"layer_512_1_bn1\"","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","}","layer {","  name: \"layer_512_1_scale1\"","  type: \"Scale\"","  bottom: \"layer_512_1_bn1\"","  top: \"layer_512_1_bn1\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  param {","    lr_mult: 2.0","    decay_mult: 1.0","  }","  scale_param {","    bias_term: true","  }","}","layer {","  name: \"layer_512_1_relu1\"","  type: \"ReLU\"","  bottom: \"layer_512_1_bn1\"","  top: \"layer_512_1_bn1\"","}","layer {","  name: \"layer_512_1_conv1_h\"","  type: \"Convolution\"","  bottom: \"layer_512_1_bn1\"","  top: \"layer_512_1_conv1_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 128","    bias_term: false","    pad: 1","    kernel_size: 3","    stride: 1 # 2","    weight_filler {","      type: \"msra\"","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"layer_512_1_bn2_h\"","  type: \"BatchNorm\"","  bottom: \"layer_512_1_conv1_h\"","  top: \"layer_512_1_conv1_h\"","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","}","layer {","  name: \"layer_512_1_scale2_h\"","  type: \"Scale\"","  bottom: \"layer_512_1_conv1_h\"","  top: \"layer_512_1_conv1_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  param {","    lr_mult: 2.0","    decay_mult: 1.0","  }","  scale_param {","    bias_term: true","  }","}","layer {","  name: \"layer_512_1_relu2\"","  type: \"ReLU\"","  bottom: \"layer_512_1_conv1_h\"","  top: \"layer_512_1_conv1_h\"","}","layer {","  name: \"layer_512_1_conv2_h\"","  type: \"Convolution\"","  bottom: \"layer_512_1_conv1_h\"","  top: \"layer_512_1_conv2_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 256","    bias_term: false","    pad: 2 # 1","    kernel_size: 3","    stride: 1","    dilation: 2","    weight_filler {","      type: \"msra\"","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"layer_512_1_conv_expand_h\"","  type: \"Convolution\"","  bottom: \"layer_512_1_bn1\"","  top: \"layer_512_1_conv_expand_h\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  convolution_param {","    num_output: 256","    bias_term: false","    pad: 0","    kernel_size: 1","    stride: 1 # 2","    weight_filler {","      type: \"msra\"","    }","    bias_filler {","      type: \"constant\"","      value: 0.0","    }","  }","}","layer {","  name: \"layer_512_1_sum\"","  type: \"Eltwise\"","  bottom: \"layer_512_1_conv2_h\"","  bottom: \"layer_512_1_conv_expand_h\"","  top: \"layer_512_1_sum\"","}","layer {","  name: \"last_bn_h\"","  type: \"BatchNorm\"","  bottom: \"layer_512_1_sum\"","  top: \"layer_512_1_sum\"","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","  param {","    lr_mult: 0.0","  }","}","layer {","  name: \"last_scale_h\"","  type: \"Scale\"","  bottom: \"layer_512_1_sum\"","  top: \"layer_512_1_sum\"","  param {","    lr_mult: 1.0","    decay_mult: 1.0","  }","  param {","    lr_mult: 2.0","    decay_mult: 1.0","  }","  scale_param {","    bias_term: true","  }","}","layer {","  name: \"last_relu\"","  type: \"ReLU\"","  bottom: \"layer_512_1_sum\"","  top: \"fc7\"","}","","layer {","  name: \"conv6_1_h\"","  type: \"Convolution\"","  bottom: \"fc7\"","  top: \"conv6_1_h\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 128","    pad: 0","    kernel_size: 1","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv6_1_relu\"","  type: \"ReLU\"","  bottom: \"conv6_1_h\"","  top: \"conv6_1_h\"","}","layer {","  name: \"conv6_2_h\"","  type: \"Convolution\"","  bottom: \"conv6_1_h\"","  top: \"conv6_2_h\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 256","    pad: 1","    kernel_size: 3","    stride: 2","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv6_2_relu\"","  type: \"ReLU\"","  bottom: \"conv6_2_h\"","  top: \"conv6_2_h\"","}","layer {","  name: \"conv7_1_h\"","  type: \"Convolution\"","  bottom: \"conv6_2_h\"","  top: \"conv7_1_h\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 64","    pad: 0","    kernel_size: 1","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv7_1_relu\"","  type: \"ReLU\"","  bottom: \"conv7_1_h\"","  top: \"conv7_1_h\"","}","layer {","  name: \"conv7_2_h\"","  type: \"Convolution\"","  bottom: \"conv7_1_h\"","  top: \"conv7_2_h\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 128","    pad: 1","    kernel_size: 3","    stride: 2","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv7_2_relu\"","  type: \"ReLU\"","  bottom: \"conv7_2_h\"","  top: \"conv7_2_h\"","}","layer {","  name: \"conv8_1_h\"","  type: \"Convolution\"","  bottom: \"conv7_2_h\"","  top: \"conv8_1_h\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 64","    pad: 0","    kernel_size: 1","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv8_1_relu\"","  type: \"ReLU\"","  bottom: \"conv8_1_h\"","  top: \"conv8_1_h\"","}","layer {","  name: \"conv8_2_h\"","  type: \"Convolution\"","  bottom: \"conv8_1_h\"","  top: \"conv8_2_h\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 128","    pad: 0","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv8_2_relu\"","  type: \"ReLU\"","  bottom: \"conv8_2_h\"","  top: \"conv8_2_h\"","}","layer {","  name: \"conv9_1_h\"","  type: \"Convolution\"","  bottom: \"conv8_2_h\"","  top: \"conv9_1_h\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 64","    pad: 0","    kernel_size: 1","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv9_1_relu\"","  type: \"ReLU\"","  bottom: \"conv9_1_h\"","  top: \"conv9_1_h\"","}","layer {","  name: \"conv9_2_h\"","  type: \"Convolution\"","  bottom: \"conv9_1_h\"","  top: \"conv9_2_h\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 128","    pad: 0","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv9_2_relu\"","  type: \"ReLU\"","  bottom: \"conv9_2_h\"","  top: \"conv9_2_h\"","}","layer {","  name: \"conv4_3_norm\"","  type: \"Normalize\"","  bottom: \"layer_256_1_bn1\"","  top: \"conv4_3_norm\"","  norm_param {","    across_spatial: false","    scale_filler {","      type: \"constant\"","      value: 20","    }","    channel_shared: false","  }","}","layer {","  name: \"conv4_3_norm_mbox_loc\"","  type: \"Convolution\"","  bottom: \"conv4_3_norm\"","  top: \"conv4_3_norm_mbox_loc\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 16","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv4_3_norm_mbox_loc_perm\"","  type: \"Permute\"","  bottom: \"conv4_3_norm_mbox_loc\"","  top: \"conv4_3_norm_mbox_loc_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"conv4_3_norm_mbox_loc_flat\"","  type: \"Flatten\"","  bottom: \"conv4_3_norm_mbox_loc_perm\"","  top: \"conv4_3_norm_mbox_loc_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"conv4_3_norm_mbox_conf\"","  type: \"Convolution\"","  bottom: \"conv4_3_norm\"","  top: \"conv4_3_norm_mbox_conf\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 8 # 84","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv4_3_norm_mbox_conf_perm\"","  type: \"Permute\"","  bottom: \"conv4_3_norm_mbox_conf\"","  top: \"conv4_3_norm_mbox_conf_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"conv4_3_norm_mbox_conf_flat\"","  type: \"Flatten\"","  bottom: \"conv4_3_norm_mbox_conf_perm\"","  top: \"conv4_3_norm_mbox_conf_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"conv4_3_norm_mbox_priorbox\"","  type: \"PriorBox\"","  bottom: \"conv4_3_norm\"","  bottom: \"data\"","  top: \"conv4_3_norm_mbox_priorbox\"","  prior_box_param {","    min_size: 30.0","    max_size: 60.0","    aspect_ratio: 2","    flip: true","    clip: false","    variance: 0.1","    variance: 0.1","    variance: 0.2","    variance: 0.2","    step: 8","    offset: 0.5","  }","}","layer {","  name: \"fc7_mbox_loc\"","  type: \"Convolution\"","  bottom: \"fc7\"","  top: \"fc7_mbox_loc\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 24","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"fc7_mbox_loc_perm\"","  type: \"Permute\"","  bottom: \"fc7_mbox_loc\"","  top: \"fc7_mbox_loc_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"fc7_mbox_loc_flat\"","  type: \"Flatten\"","  bottom: \"fc7_mbox_loc_perm\"","  top: \"fc7_mbox_loc_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"fc7_mbox_conf\"","  type: \"Convolution\"","  bottom: \"fc7\"","  top: \"fc7_mbox_conf\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 12 # 126","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"fc7_mbox_conf_perm\"","  type: \"Permute\"","  bottom: \"fc7_mbox_conf\"","  top: \"fc7_mbox_conf_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"fc7_mbox_conf_flat\"","  type: \"Flatten\"","  bottom: \"fc7_mbox_conf_perm\"","  top: \"fc7_mbox_conf_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"fc7_mbox_priorbox\"","  type: \"PriorBox\"","  bottom: \"fc7\"","  bottom: \"data\"","  top: \"fc7_mbox_priorbox\"","  prior_box_param {","    min_size: 60.0","    max_size: 111.0","    aspect_ratio: 2","    aspect_ratio: 3","    flip: true","    clip: false","    variance: 0.1","    variance: 0.1","    variance: 0.2","    variance: 0.2","    step: 16","    offset: 0.5","  }","}","layer {","  name: \"conv6_2_mbox_loc\"","  type: \"Convolution\"","  bottom: \"conv6_2_h\"","  top: \"conv6_2_mbox_loc\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 24","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv6_2_mbox_loc_perm\"","  type: \"Permute\"","  bottom: \"conv6_2_mbox_loc\"","  top: \"conv6_2_mbox_loc_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"conv6_2_mbox_loc_flat\"","  type: \"Flatten\"","  bottom: \"conv6_2_mbox_loc_perm\"","  top: \"conv6_2_mbox_loc_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"conv6_2_mbox_conf\"","  type: \"Convolution\"","  bottom: \"conv6_2_h\"","  top: \"conv6_2_mbox_conf\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 12 # 126","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv6_2_mbox_conf_perm\"","  type: \"Permute\"","  bottom: \"conv6_2_mbox_conf\"","  top: \"conv6_2_mbox_conf_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"conv6_2_mbox_conf_flat\"","  type: \"Flatten\"","  bottom: \"conv6_2_mbox_conf_perm\"","  top: \"conv6_2_mbox_conf_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"conv6_2_mbox_priorbox\"","  type: \"PriorBox\"","  bottom: \"conv6_2_h\"","  bottom: \"data\"","  top: \"conv6_2_mbox_priorbox\"","  prior_box_param {","    min_size: 111.0","    max_size: 162.0","    aspect_ratio: 2","    aspect_ratio: 3","    flip: true","    clip: false","    variance: 0.1","    variance: 0.1","    variance: 0.2","    variance: 0.2","    step: 32","    offset: 0.5","  }","}","layer {","  name: \"conv7_2_mbox_loc\"","  type: \"Convolution\"","  bottom: \"conv7_2_h\"","  top: \"conv7_2_mbox_loc\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 24","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv7_2_mbox_loc_perm\"","  type: \"Permute\"","  bottom: \"conv7_2_mbox_loc\"","  top: \"conv7_2_mbox_loc_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"conv7_2_mbox_loc_flat\"","  type: \"Flatten\"","  bottom: \"conv7_2_mbox_loc_perm\"","  top: \"conv7_2_mbox_loc_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"conv7_2_mbox_conf\"","  type: \"Convolution\"","  bottom: \"conv7_2_h\"","  top: \"conv7_2_mbox_conf\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 12 # 126","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv7_2_mbox_conf_perm\"","  type: \"Permute\"","  bottom: \"conv7_2_mbox_conf\"","  top: \"conv7_2_mbox_conf_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"conv7_2_mbox_conf_flat\"","  type: \"Flatten\"","  bottom: \"conv7_2_mbox_conf_perm\"","  top: \"conv7_2_mbox_conf_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"conv7_2_mbox_priorbox\"","  type: \"PriorBox\"","  bottom: \"conv7_2_h\"","  bottom: \"data\"","  top: \"conv7_2_mbox_priorbox\"","  prior_box_param {","    min_size: 162.0","    max_size: 213.0","    aspect_ratio: 2","    aspect_ratio: 3","    flip: true","    clip: false","    variance: 0.1","    variance: 0.1","    variance: 0.2","    variance: 0.2","    step: 64","    offset: 0.5","  }","}","layer {","  name: \"conv8_2_mbox_loc\"","  type: \"Convolution\"","  bottom: \"conv8_2_h\"","  top: \"conv8_2_mbox_loc\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 16","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv8_2_mbox_loc_perm\"","  type: \"Permute\"","  bottom: \"conv8_2_mbox_loc\"","  top: \"conv8_2_mbox_loc_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"conv8_2_mbox_loc_flat\"","  type: \"Flatten\"","  bottom: \"conv8_2_mbox_loc_perm\"","  top: \"conv8_2_mbox_loc_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"conv8_2_mbox_conf\"","  type: \"Convolution\"","  bottom: \"conv8_2_h\"","  top: \"conv8_2_mbox_conf\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 8 # 84","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv8_2_mbox_conf_perm\"","  type: \"Permute\"","  bottom: \"conv8_2_mbox_conf\"","  top: \"conv8_2_mbox_conf_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"conv8_2_mbox_conf_flat\"","  type: \"Flatten\"","  bottom: \"conv8_2_mbox_conf_perm\"","  top: \"conv8_2_mbox_conf_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"conv8_2_mbox_priorbox\"","  type: \"PriorBox\"","  bottom: \"conv8_2_h\"","  bottom: \"data\"","  top: \"conv8_2_mbox_priorbox\"","  prior_box_param {","    min_size: 213.0","    max_size: 264.0","    aspect_ratio: 2","    flip: true","    clip: false","    variance: 0.1","    variance: 0.1","    variance: 0.2","    variance: 0.2","    step: 100","    offset: 0.5","  }","}","layer {","  name: \"conv9_2_mbox_loc\"","  type: \"Convolution\"","  bottom: \"conv9_2_h\"","  top: \"conv9_2_mbox_loc\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 16","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv9_2_mbox_loc_perm\"","  type: \"Permute\"","  bottom: \"conv9_2_mbox_loc\"","  top: \"conv9_2_mbox_loc_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"conv9_2_mbox_loc_flat\"","  type: \"Flatten\"","  bottom: \"conv9_2_mbox_loc_perm\"","  top: \"conv9_2_mbox_loc_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"conv9_2_mbox_conf\"","  type: \"Convolution\"","  bottom: \"conv9_2_h\"","  top: \"conv9_2_mbox_conf\"","  param {","    lr_mult: 1","    decay_mult: 1","  }","  param {","    lr_mult: 2","    decay_mult: 0","  }","  convolution_param {","    num_output: 8 # 84","    pad: 1","    kernel_size: 3","    stride: 1","    weight_filler {","      type: \"xavier\"","    }","    bias_filler {","      type: \"constant\"","      value: 0","    }","  }","}","layer {","  name: \"conv9_2_mbox_conf_perm\"","  type: \"Permute\"","  bottom: \"conv9_2_mbox_conf\"","  top: \"conv9_2_mbox_conf_perm\"","  permute_param {","    order: 0","    order: 2","    order: 3","    order: 1","  }","}","layer {","  name: \"conv9_2_mbox_conf_flat\"","  type: \"Flatten\"","  bottom: \"conv9_2_mbox_conf_perm\"","  top: \"conv9_2_mbox_conf_flat\"","  flatten_param {","    axis: 1","  }","}","layer {","  name: \"conv9_2_mbox_priorbox\"","  type: \"PriorBox\"","  bottom: \"conv9_2_h\"","  bottom: \"data\"","  top: \"conv9_2_mbox_priorbox\"","  prior_box_param {","    min_size: 264.0","    max_size: 315.0","    aspect_ratio: 2","    flip: true","    clip: false","    variance: 0.1","    variance: 0.1","    variance: 0.2","    variance: 0.2","    step: 300","    offset: 0.5","  }","}","layer {","  name: \"mbox_loc\"","  type: \"Concat\"","  bottom: \"conv4_3_norm_mbox_loc_flat\"","  bottom: \"fc7_mbox_loc_flat\"","  bottom: \"conv6_2_mbox_loc_flat\"","  bottom: \"conv7_2_mbox_loc_flat\"","  bottom: \"conv8_2_mbox_loc_flat\"","  bottom: \"conv9_2_mbox_loc_flat\"","  top: \"mbox_loc\"","  concat_param {","    axis: 1","  }","}","layer {","  name: \"mbox_conf\"","  type: \"Concat\"","  bottom: \"conv4_3_norm_mbox_conf_flat\"","  bottom: \"fc7_mbox_conf_flat\"","  bottom: \"conv6_2_mbox_conf_flat\"","  bottom: \"conv7_2_mbox_conf_flat\"","  bottom: \"conv8_2_mbox_conf_flat\"","  bottom: \"conv9_2_mbox_conf_flat\"","  top: \"mbox_conf\"","  concat_param {","    axis: 1","  }","}","layer {","  name: \"mbox_priorbox\"","  type: \"Concat\"","  bottom: \"conv4_3_norm_mbox_priorbox\"","  bottom: \"fc7_mbox_priorbox\"","  bottom: \"conv6_2_mbox_priorbox\"","  bottom: \"conv7_2_mbox_priorbox\"","  bottom: \"conv8_2_mbox_priorbox\"","  bottom: \"conv9_2_mbox_priorbox\"","  top: \"mbox_priorbox\"","  concat_param {","    axis: 2","  }","}","","layer {","  name: \"mbox_conf_reshape\"","  type: \"Reshape\"","  bottom: \"mbox_conf\"","  top: \"mbox_conf_reshape\"","  reshape_param {","    shape {","      dim: 0","      dim: -1","      dim: 2","    }","  }","}","layer {","  name: \"mbox_conf_softmax\"","  type: \"Softmax\"","  bottom: \"mbox_conf_reshape\"","  top: \"mbox_conf_softmax\"","  softmax_param {","    axis: 2","  }","}","layer {","  name: \"mbox_conf_flatten\"","  type: \"Flatten\"","  bottom: \"mbox_conf_softmax\"","  top: \"mbox_conf_flatten\"","  flatten_param {","    axis: 1","  }","}","","layer {","  name: \"detection_out\"","  type: \"DetectionOutput\"","  bottom: \"mbox_loc\"","  bottom: \"mbox_conf_flatten\"","  bottom: \"mbox_priorbox\"","  top: \"detection_out\"","  include {","    phase: TEST","  }","  detection_output_param {","    num_classes: 2","    share_location: true","    background_label_id: 0","    nms_param {","      nms_threshold: 0.45","      top_k: 400","    }","    code_type: CENTER_SIZE","    keep_top_k: 200","    confidence_threshold: 0.01","    clip: 1","  }","}"],"stylingDirectives":[[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],"csv":null,"csvError":null,"dependabotInfo":{"showConfigurationBanner":false,"configFilePath":null,"networkDependabotPath":"/opencv/opencv/network/updates","dismissConfigurationNoticePath":"/settings/dismiss-notice/dependabot_configuration_notice","configurationNoticeDismissed":null,"repoAlertsPath":"/opencv/opencv/security/dependabot","repoSecurityAndAnalysisPath":"/opencv/opencv/settings/security_analysis","repoOwnerIsOrg":true,"currentUserCanAdminRepo":false},"displayName":"deploy.prototxt","displayUrl":"https://github.com/opencv/opencv/blob/master/samples/dnn/face_detector/deploy.prototxt?raw=true","headerInfo":{"blobSize":"27.4 KB","deleteInfo":{"deleteTooltip":"You must be signed in to make or propose changes"},"editInfo":{"editTooltip":"You must be signed in to make or propose changes"},"ghDesktopPath":"https://desktop.github.com","gitLfsPath":null,"onBranch":true,"shortPath":"a128515","siteNavLoginPath":"/login?return_to=https%3A%2F%2Fgithub.com%2Fopencv%2Fopencv%2Fblob%2Fmaster%2Fsamples%2Fdnn%2Fface_detector%2Fdeploy.prototxt","isCSV":false,"isRichtext":false,"toc":null,"lineInfo":{"truncatedLoc":"1790","truncatedSloc":"1786"},"mode":"file"},"image":false,"isCodeownersFile":null,"isPlain":false,"isValidLegacyIssueTemplate":false,"issueTemplateHelpUrl":"https://docs.github.com/articles/about-issue-and-pull-request-templates","issueTemplate":null,"discussionTemplate":null,"language":null,"languageID":null,"large":false,"loggedIn":false,"newDiscussionPath":"/opencv/opencv/discussions/new","newIssuePath":"/opencv/opencv/issues/new","planSupportInfo":{"repoIsFork":null,"repoOwnedByCurrentUser":null,"requestFullPath":"/opencv/opencv/blob/master/samples/dnn/face_detector/deploy.prototxt","showFreeOrgGatedFeatureMessage":null,"showPlanSupportBanner":null,"upgradeDataAttributes":null,"upgradePath":null},"publishBannersInfo":{"dismissActionNoticePath":"/settings/dismiss-notice/publish_action_from_dockerfile","dismissStackNoticePath":"/settings/dismiss-notice/publish_stack_from_file","releasePath":"/opencv/opencv/releases/new?marketplace=true","showPublishActionBanner":false,"showPublishStackBanner":false},"rawBlobUrl":"https://github.com/opencv/opencv/raw/master/samples/dnn/face_detector/deploy.prototxt",